NevynUK/ESP32-P4-Protected-Mode-Sample/main/kernel_main.c
    stack_top = (uintptr_t) u->arena + u->arena_size;
    stack_top &= ~(uintptr_t) 15;

    ctx->x[1] = (uint32_t) (uintptr_t) u_exit_stub; /* ra */
    ctx->x[2] = (uint32_t) stack_top;               /* sp */
    ctx->x[10] = u->id;                             /* a0 = user_main's arg */
    ctx->pc = (uint32_t) (uintptr_t) user_main;
    ctx->mcause = 0;
    ctx->mtval = 0;

    /* The range ESP-IDF's hardware stack guard watches while the window is open.
     * umode.S swaps this in for the host task's bounds on the way down and back
     * out again on the way up, so a user that runs its stack off either end of
     * the arena is caught by the same silicon that protects every kernel task --
     * and is reported as a user fault rather than panicking the kernel.
     */

    ctx->u_sp_min = (uint32_t) (uintptr_t) u->arena;
    ctx->u_sp_max = (uint32_t) stack_top;
    ctx->sp_fired = 0;
    ctx->sp_pc = 0;
}

/****************************************************************************
 * Name: kernel_task
 *
 * Description:
 *   The M-mode half of the demonstration: "Kernel x" once a second.  An
 *   entirely ordinary FreeRTOS task -- the point is that it keeps running at
 *   its own cadence while the other task is dropping in and out of U-mode.
 *
 ****************************************************************************/
static void kernel_task(void *arg)
{
    TickType_t last = xTaskGetTickCount();
    uint32_t n = 1;
    int i;

    (void) arg;

    for (;;)
    {
        kprintf("Kernel %lu (core %d)\n", (unsigned long) n++, xPortGetCoreID());

        /* Where every U-mode window is, and how often each has moved, on one
         * line -- eight of them do not fit one per line.  Read without a lock:
         * these are 32-bit aligned words on RV32, so each read is atomic and
         * the worst case is a figure one window stale.
         */

        if ((n % MIGRATION_REPORT_EVERY) == 0)
        {
            char line[USER_SLOTS * 20 + 1];
            int off = 0;

            for (i = 0; i < USER_SLOTS; i++)
            {
                off += snprintf(line + off, sizeof(line) - (size_t) off, " u%d:c%d/%lu", i, g_slots[i].core, (unsigned long) g_slots[i].migrations);
            }

            kprintf("KERNEL: window:core/moves%s\n", line);
        }
        vTaskDelayUntil(&last, pdMS_TO_TICKS(KERNEL_PERIOD_MS));
    }
}

/****************************************************************************
 * Name: user_host_task
 *
 * Description:
 *   The U-mode half.  This task is not the user application -- it is the
 *   kernel-side host that runs it.  Each pass through the loop drops to
 *   U-mode, comes back on the next trap, and decides what to do about it.
 *
 *   One of these runs per slot, on the slot's own core, at the same time.  The
 *   loop below touches nothing outside its own slot except kprintf(), so the
 *   two instances need no lock between them: the window itself is entirely
 *   core-local, from the CSRs umode_enter() borrows to the assist_debug block
 *   it picks out of mhartid.
 *
 ****************************************************************************/
static void user_host_task(void *arg)
{
    user_slot_t *u = (user_slot_t *) arg;

    /* Nothing to assert: where this runs is the scheduler's business.  Record
     * where it started so the first window is not counted as a move.
     */

    u->core = xPortGetCoreID();

    user_ctx_init(u);

    kprintf("KERNEL: %s: entering U-mode on core %d at pc=%08lx sp=%08lx\n", u->name, xPortGetCoreID(), (unsigned long) u->ctx.pc, (unsigned long) u->ctx.x[2]);

    u->running = true;

    while (u->running)
    {
        const uint32_t cause = umode_enter(&u->ctx);
        const int core = xPortGetCoreID();

        /* The window just ran somewhere.  If that is not where the last one
         * ran, the scheduler moved this task between windows -- which is the
         * whole point of the demo, so it is counted rather than assumed.
         */

        if (core != u->core)
        {
            u->core = core;
            u->migrations++;
        }

        /* Checked before the trap cause, because it is independent of it: the
         * user overflowed its stack at some point in the window and then got
         * here by whatever means -- very likely an ordinary syscall.
         */

        if (u->ctx.sp_fired != 0)
        {
            report_stack_fault(u);
            u->running = false;
            continue;
        }

        if ((cause & MCAUSE_INTERRUPT) != 0)
        {
            /* An interrupt landed inside the U-mode window.  umode.S put
             * ESP-IDF's vector back before returning, so it has already been
             * serviced; pick U-mode up exactly where it was.
             */

            u->irqs_in_user++;
            continue;
        }

        if ((cause & MCAUSE_EXCCODE_MASK) == EXC_ECALL_U)
        {
            u->running = syscall_dispatch(u);
            continue;
        }

        report_fault(u);
        u->running = false;
    }

    kprintf(
        "KERNEL: %s: user context retired after %lu syscalls "
        "(%lu interrupts taken in U-mode, %lu core changes)\n",
        u->name, (unsigned long) u->syscalls, (unsigned long) u->irqs_in_user, (unsigned long) u->migrations);

    vTaskDelete(NULL);
}

/****************************************************************************
 * Name: grant_extram_to_umode
 *
 * Description:
 *   Hand U-mode the whole external RAM window.
 *
 *   Called on each core because pmpaddr and pmpcfg are per-hart, so a grant
 *   made on core 0 means nothing on core 1 -- and with unpinned host tasks a
 *   window runs on whichever core the scheduler picked.
 *
 ****************************************************************************/
static void grant_extram_to_umode(void *arg)
{
    (void) arg;

    umode_pmp_grant_extram(SOC_EXTRAM_LOW, SOC_EXTRAM_HIGH);
}

/****************************************************************************
 * Name: pmp_report
 *
 * Description:
 *   Decode and print all sixteen PMP entries, then name the parts of the
 *   memory map that no entry covers.
 *
 *   That last list is the interesting one and it is not obvious from the
 *   entries themselves.  PMP is default-DENY for U-mode and default-allow for
 *   M-mode: an address no entry matches is unreachable from U-mode and
 *   perfectly reachable from the kernel.  Those ranges are therefore the only
 *   memory on this board that U-mode cannot touch by hardware, which makes
 *   them the one place kernel data can be put out of a user's reach without
 *   unlocking anything -- see Documentation/isolation-limits.md.
 *
 ****************************************************************************/
static void pmp_report(void)
{
    static const struct
    {
        const char *name;
        uint32_t lo;
        uint32_t hi;
    } regions[] = {
        { "internal SRAM", SOC_IRAM_LOW, SOC_IRAM_HIGH },
        { "PSRAM window", SOC_EXTRAM_LOW, SOC_EXTRAM_HIGH },
        { "flash window", SOC_IROM_LOW, SOC_IROM_HIGH },
        { "TCM", SOC_TCM_LOW, SOC_TCM_HIGH },
        { "RTC / LP RAM", SOC_RTC_IRAM_LOW, SOC_RTC_IRAM_HIGH },
        { "peripherals", SOC_PERIPHERAL_LOW, SOC_PERIPHERAL_HIGH },
    };

